# NodeName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RenderNode..::..NodeName Property
RenderNode Class See Also
---
A readable name of the output node.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public string NodeName { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NodeName As String
	Get
```

Visual C++
---
```text
public:
property String^ NodeName {
	String^ get ();
}
```

# See Also
RenderNode Class
Autodesk.Revit.DB Namespace